---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.HermiteSurface
source: html/4f0bbef2-f23e-1e99-b1bc-47dfb8499199.htm
---
# HermiteSurface Members

Create a non-periodic Hermite surface using a net of 3D points as input.